app/controllers/users_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "users" ("city", "cp_3d", "cp_4d", "created_at", "customer_id", "date_of_birth", "email", "email_state", "gender", "name", "password", "phone", "stret_addr", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.find(params[:customer_id])
    @user = @customer.users.create(params[:user])